trade_exp/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
  </predefined>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаАктивна</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаАктивацииБонуснойПрограммы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПИН_Код</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2d8cff6-485d-4179-8e9c-c0e74d4f7704">
    <name>АктивнаяФаза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ed10a1b-4743-4b2e-b332-43a49c33d53a">
    <name>ОбъемСтроительства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d937f9b-c6c0-400a-a976-e17d07dc2cf4">
    <name>ДатаНачалаАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ab7b5f85-1360-48d2-9266-6d9b809fa216">
    <name>НормативПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПодтвержденияНомераТелефона</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНомераТелефона</name>
    <type>
      <types>EnumRef.СостояниеНомераТелефона</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойОборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="63694e17-0adb-4a8a-afea-e4e7735edfc1">
    <name>СоглашениеДляРассылок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf121ead-3982-46d0-bcce-a08413595a1f">
    <name>Парсинг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="59343292-e18c-4609-a039-11cc8d8cd93a">
    <name>ВидыНоменклатурыАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="eeb4daa7-609a-4968-8745-1b6125400c0b">
      <name>ВидНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f09dd5d-7de9-4a21-a839-9674c6120b36">
      <name>Коэффициент</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e8a1213f-80cf-4cf1-866d-59ee4fa4ffbe">
      <name>ЭтапСтроительства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0daacbf9-aa02-4485-a535-d2d28b00523c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8667b665-ede0-456e-ad08-51f4cf43503a">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6203050a-d3b4-4e82-89f7-5ad54cf4906b">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3b79728c-4ce5-4330-b398-b32f0bb3e6d5">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9e943c2-8fad-47c5-b878-66f2576cc609">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2ac6cdc9-f345-456a-9bd8-2e5ae5af6f56">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6245a898-0f24-4b85-b2d7-89831867e9d9">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9d10a2ad-841d-4931-902b-83db2a08aaaa">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2acd53d1-e5ab-4fe9-8341-24b714c87f11">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e30e3544-d00d-4269-ac29-88451a763262">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="675d6c69-31a6-49c2-a9b2-cc82f578bbeb">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce03862f-daeb-4d43-a69d-c989cd1f6089">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72399ba5-bcbe-40be-b76e-ff36467bc65d">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="df571c83-e6f9-459f-abbc-6e6053e6eb48">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/ПартнерыСегмента/ПартнерыСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПартнерыСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/КомпанияЧастноеЛицо/КомпанияЧастноеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КомпанияЧастноеЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="640f3f70-7e8d-48fb-8487-fda65cb57f60">
    <name>ЧастноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af9cb34d-d5ea-4de1-a7d6-999e6bd67541">
    <name>Компания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4e2da66-9a70-459f-a873-cb4ad71d17b2">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fef27478-ddfd-4ad9-8161-148761f29698">
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="39cbda23-db3f-4ddd-8981-8540247406db">
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c8a18d99-62ff-45a4-acb5-48e3310c1b53">
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a6eb0cb1-80f0-4390-80ff-7af53f8e63c3">
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Партнеры/ManagerModule.bsl
#Область Проверки
Функция ЕстьПартнерЧастноеЛицоСТакимТелефоном(ЭтотПартнер, Отказ, ТелефонПартнера="") Экспорт
	
	Отказ = Ложь;
	
	Если ЭтотПартнер = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Партнер
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.НомерТелефона = &ТелефонПартнера
		|	И ПартнерыКонтактнаяИнформация.Вид = &ВидТелефон
		|	И ПартнерыКонтактнаяИнформация.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
		|	И НЕ ПартнерыКонтактнаяИнформация.Ссылка.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ТелефонПартнера", ТелефонПартнера);
		Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
		Запрос.УстановитьПараметр("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			АльтерраОбщегоНазначения.СообщитьПользователю(ВыборкаДетальныеЗаписи.Партнер, "У частного лица "+ВыборкаДетальныеЗаписи.Партнер+" такой же номер телефона. Запрещено вводить партнеров-частные лица с одинаковыми номерами");
			Отказ = Истина;
		КонецЕсли;
	
	Иначе	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Партнер,
		|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ПОМЕСТИТЬ ВТ_Телефон
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Ссылка = &ЭтотПартнер
		|	И ПартнерыКонтактнаяИнформация.Вид = &ВидТелефон
		|	И ПартнерыКонтактнаяИнформация.НомерТелефона <> """"
		|	И ПартнерыКонтактнаяИнформация.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Партнер
		|ИЗ
		|	ВТ_Телефон КАК ВТ_Телефон
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|		ПО ВТ_Телефон.НомерТелефона = ПартнерыКонтактнаяИнформация.НомерТелефона
		|			И (&ВидТелефон = ПартнерыКонтактнаяИнформация.Вид)
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Ссылка <> &ЭтотПартнер
		|	И ПартнерыКонтактнаяИнформация.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
		|	И НЕ ПартнерыКонтактнаяИнформация.Ссылка.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ЭтотПартнер", ЭтотПартнер);
		Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
		Запрос.УстановитьПараметр("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			АльтерраОбщегоНазначения.СообщитьПользователю(ВыборкаДетальныеЗаписи.Партнер, "У частного лица "+ВыборкаДетальныеЗаписи.Партнер+" такой же номер телефона. Запрещено вводить партнеров-частные лица с одинаковыми номерами");
			Отказ = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

//Расширенный поиск для Документа "Начисление и списание бонусных баллов"
&После("ОбработкаПолученияДанныхВыбора")
Процедура Док_ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтрокаПоиска = СтрЗаменить(Параметры.СтрокаПоиска, """", ""); // нормализация
	
	Если СтрокаПоиска <> "" И Параметры.Свойство("ВводПоСтрокеРасширенный") Тогда
		
		МаксимумСтрокРезультата = 30;
		
		МассивСловПоиска = СтрРазделить(СтрокаПоиска, " ", Ложь);
		КоличествоСловПоиска = МассивСловПоиска.Количество();
		
		Если КоличествоСловПоиска > 0 Тогда
		
			СтандартнаяОбработка = Ложь;		
			СписокВыбора = Новый СписокЗначений;
			
			Запрос = Новый Запрос;
			
			УсловияПоиска = ""; 
			ПриоритетСортировки = "";
			Для НомерСловаПоиска = 1 По КоличествоСловПоиска Цикл
				
				СловоПоиска = МассивСловПоиска[НомерСловаПоиска - 1];
				ДлинаСловаПоиска = СтрДлина(СловоПоиска);
				
				Запрос.УстановитьПараметр("СловоПоиска" + НомерСловаПоиска, "%" + СловоПоиска + "%");
				УсловияПоиска = УсловияПоиска + "
				|	И Партнеры.Код ПОДОБНО &СловоПоиска" + НомерСловаПоиска;
				
				ПриоритетСортировки = ПриоритетСортировки + СтрШаблон("
				|		КОГДА ПОДСТРОКА(Партнеры.Код, 1, %1) = ""%2""
				|		  ТОГДА %3", Формат(ДлинаСловаПоиска, "ЧГ="), СловоПоиска, НомерСловаПоиска);
				
			КонецЦикла;
			
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ " + МаксимумСтрокРезультата + "
			|	Партнеры.Ссылка КАК Ссылка,
			|	Партнеры.Наименование КАК Наименование,
			|	Партнеры.Код КАК Код,
			|	Партнеры.ПометкаУдаления КАК ПометкаУдаления,
			|	ВЫБОР" + ПриоритетСортировки + "
			|		ИНАЧЕ 9
			|	КОНЕЦ КАК ПриоритетСортировки
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|ГДЕ
			|	ИСТИНА" + УсловияПоиска + "
			|УПОРЯДОЧИТЬ ПО
			|	ПриоритетСортировки, Наименование";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СписокВыбора.Добавить(Новый Структура("Значение, ПометкаУдаления", Выборка.Ссылка, Выборка.ПометкаУдаления), ПодсветитьСлова("("+Выборка.Код+") "+Выборка.Наименование, МассивСловПоиска));
				
			КонецЦикла;
			
			ДанныеВыбора = СписокВыбора;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодсветитьСлова(ИсходнаяСтрока, МассивСловПодсветки, Знач ШрифтПодсветки = Неопределено, Знач ЦветПодсветки = Неопределено)
	
	МассивРезультирующихСтрок = Новый Массив;
	
	Если ШрифтПодсветки = Неопределено Тогда
		ШрифтПодсветки = Новый Шрифт(,, Истина); // жирный
	КонецЕсли;
	
	Если ЦветПодсветки = Неопределено Тогда
		ЦветПодсветки = Новый Цвет(0, 153, 0); // светло-зеленый из стандартной подсветки ввода по строке
	КонецЕсли;
	
	ИсходнаяСтрокаНормализованная = НРег(ИсходнаяСтрока); // нормализация
	ДлинаИсходнойСтроки = СтрДлина(ИсходнаяСтрокаНормализованная);
	
	// получим список диапазонов символов для подсветки
	СписокДиапазонов = Новый СписокЗначений;
	Для НомерСлова = 1 По МассивСловПодсветки.Количество() Цикл
		СловоПодсветки = НРег(МассивСловПодсветки[НомерСлова - 1]); // нормализация
		ПозицияНачалаСлова = 1;
		ДлинаСлова = СтрДлина(СловоПодсветки);
		Пока ПозицияНачалаСлова <> 0 И ПозицияНачалаСлова <= ДлинаИсходнойСтроки Цикл
			ПозицияНачалаСлова = СтрНайти(ИсходнаяСтрокаНормализованная, СловоПодсветки, , ПозицияНачалаСлова);
			Если ПозицияНачалаСлова > 0 Тогда
				МассивДиапазона = Новый Массив;
				МассивДиапазона.Добавить(ПозицияНачалаСлова);
				МассивДиапазона.Добавить(ПозицияНачалаСлова + ДлинаСлова - 1);
				СписокДиапазонов.Добавить(МассивДиапазона, Формат(ПозицияНачалаСлова, "ЧЦ=3; ЧВН="));
				ПозицияНачалаСлова = ПозицияНачалаСлова + ДлинаСлова;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// отсортируем список диапазонов по возрастанию начал диапазонов
	СписокДиапазонов.СортироватьПоПредставлению();
	
	// сформируем массив результирующих строк с разным оформлением (подсветкой)
	СтартоваяПозиция = 1;
	Для Каждого ЭлементДиапазона Из СписокДиапазонов Цикл
		НачалоДиапазона = ЭлементДиапазона.Значение[0];
		КонецДиапазона = ЭлементДиапазона.Значение[1];
		Если НачалоДиапазона > СтартоваяПозиция Тогда // часть строки без подсветки
			ЧастьБезВыделения = Сред(ИсходнаяСтрока, СтартоваяПозиция, НачалоДиапазона - СтартоваяПозиция);
			МассивРезультирующихСтрок.Добавить(Новый ФорматированнаяСтрока(ЧастьБезВыделения));
			СтартоваяПозиция = НачалоДиапазона;
		КонецЕсли;
		Если КонецДиапазона >= СтартоваяПозиция Тогда // часть строки с подсветкой
			ЧастьВыделяемая = Сред(ИсходнаяСтрока, СтартоваяПозиция, КонецДиапазона - СтартоваяПозиция + 1);
			МассивРезультирующихСтрок.Добавить(Новый ФорматированнаяСтрока(ЧастьВыделяемая, ШрифтПодсветки, ЦветПодсветки));
			СтартоваяПозиция = КонецДиапазона + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если СтартоваяПозиция <= ДлинаИсходнойСтроки Тогда // "хвост" без выделения
		Хвост = Сред(ИсходнаяСтрока, СтартоваяПозиция, ДлинаИсходнойСтроки - СтартоваяПозиция + 1);
		МассивРезультирующихСтрок.Добавить(Новый ФорматированнаяСтрока(Хвост));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивРезультирующихСтрок);
	
КонецФункции

Функция ПроверитьПоСегментуЗапретОтгрузки(Партнер, ПараметрыПроверки=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыСегмента.Партнер КАК Партнер,
		|	ПартнерыСегмента.Партнер.Наименование КАК ПартнерНаименование
		|ПОМЕСТИТЬ ВТ_Партнеры
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|ГДЕ
		|	ПартнерыСегмента.Сегмент.ЗапретОтгрузки
		|	И ПартнерыСегмента.Партнер <> &Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Партнеры.Партнер.Ссылка КАК Партнер,
		|	ВТ_Партнеры.Партнер.Наименование КАК Наименование,
		|	ЕСТЬNULL(ВТ_Партнеры.Партнер.Б_Идентификатор, """") КАК Б_Идентификатор,
		|	ЕСТЬNULL(ПартнерыКонтактнаяИнформацияПочта.АдресЭП, """") КАК Почта,
		|	ЕСТЬNULL(ПартнерыКонтактнаяИнформацияТелефон.НомерТелефона, """") КАК Телефон,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеров.Ссылка, """") КАК КонтактноеЛицо,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеров.Наименование, """") КАК КонтактноеЛицоФИО,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеров.ДолжностьПоВизитке, """") КАК КонтактноеЛицоДолжность,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеровКонтактнаяИнформацияТелефон.НомерТелефона, """") КАК КонтактноеЛицоТелефон,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица.Наименование, """") КАК КонтактноеЛицоРоль,
		|	ПартнерыКонтактнаяИнформацияАдрес.Представление КАК Фактический
		|ПОМЕСТИТЬ ВТ_Контакты
		|ИЗ
		|	ВТ_Партнеры КАК ВТ_Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияПочта
		|		ПО ВТ_Партнеры.Партнер = ПартнерыКонтактнаяИнформацияПочта.Ссылка
		|			И (&ТипПочта = ПартнерыКонтактнаяИнформацияПочта.Тип)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияТелефон
		|		ПО ВТ_Партнеры.Партнер = ПартнерыКонтактнаяИнформацияТелефон.Ссылка
		|			И (&ТипТелефон = ПартнерыКонтактнаяИнформацияТелефон.Тип)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияАдрес
		|		ПО ВТ_Партнеры.Партнер = ПартнерыКонтактнаяИнформацияАдрес.Ссылка
		|			И (&ТипАдрес = ПартнерыКонтактнаяИнформацияАдрес.Тип)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.РолиКонтактногоЛица КАК КонтактныеЛицаПартнеровРолиКонтактногоЛица
		|			ПО КонтактныеЛицаПартнеров.Ссылка = КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформацияТелефон
		|			ПО КонтактныеЛицаПартнеров.Ссылка = КонтактныеЛицаПартнеровКонтактнаяИнформацияТелефон.Ссылка
		|				И (&ТипТелефон = КонтактныеЛицаПартнеровКонтактнаяИнформацияТелефон.Тип)
		|		ПО ВТ_Партнеры.Партнер = КонтактныеЛицаПартнеров.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контакты.Партнер КАК Партнер,
		|	ВТ_Контакты.Наименование КАК Параметр,
		|	""по наименованию"" КАК Проверка
		|ПОМЕСТИТЬ ВТ_Проверка
		|ИЗ
		|	ВТ_Контакты КАК ВТ_Контакты
		|ГДЕ
		|	ВТ_Контакты.Наименование ПОДОБНО &Фамилия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Контакты.Партнер,
		|	ВТ_Контакты.Почта,
		|	""по почте""
		|ИЗ
		|	ВТ_Контакты КАК ВТ_Контакты
		|ГДЕ
		|	ВТ_Контакты.Почта = &Почта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Контакты.Партнер,
		|	ВТ_Контакты.Телефон,
		|	""по телефону""
		|ИЗ
		|	ВТ_Контакты КАК ВТ_Контакты
		|ГДЕ
		|	ВТ_Контакты.Телефон = &Телефон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Контакты.Партнер,
		|	ВТ_Контакты.КонтактноеЛицоТелефон,
		|	""по телефону контактного лица""
		|ИЗ
		|	ВТ_Контакты КАК ВТ_Контакты
		|ГДЕ
		|	ВТ_Контакты.КонтактноеЛицоТелефон = &Телефон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Контакты.Партнер,
		|	ВТ_Контакты.КонтактноеЛицоФИО,
		|	""по наименованию контактного лица""
		|ИЗ
		|	ВТ_Контакты КАК ВТ_Контакты
		|ГДЕ
		|	ВТ_Контакты.КонтактноеЛицоФИО ПОДОБНО &Фамилия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Контакты.Партнер,
		|	ВТ_Контакты.Фактический,
		|	""по адресу""
		|ИЗ
		|	ВТ_Контакты КАК ВТ_Контакты
		|ГДЕ
		|	ВТ_Контакты.Фактический ПОДОБНО &Адрес
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Контакты.Партнер,
		|	ВТ_Контакты.Наименование,
		|	""по наименованию""
		|ИЗ
		|	ВТ_Контакты КАК ВТ_Контакты
		|ГДЕ
		|	ВТ_Контакты.Партнер.НаименованиеПолное ПОДОБНО &Фамилия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Контакты.Партнер,
		|	ВТ_Контакты.Наименование,
		|	""по наименованию""
		|ИЗ
		|	ВТ_Контакты КАК ВТ_Контакты
		|ГДЕ
		|	ВТ_Контакты.Наименование ПОДОБНО &Фамилия2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Контакты.Партнер,
		|	ВТ_Контакты.Наименование,
		|	""по наименованию""
		|ИЗ
		|	ВТ_Контакты КАК ВТ_Контакты
		|ГДЕ
		|	ВТ_Контакты.Партнер.НаименованиеПолное ПОДОБНО &Фамилия2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Проверка.Партнер КАК Партнер,
		|	ВТ_Проверка.Параметр КАК Параметр,
		|	ВТ_Проверка.Проверка КАК Проверка
		|ИЗ
		|	ВТ_Проверка КАК ВТ_Проверка";
		
		Если ЗначениеЗаполнено(ПараметрыПроверки) Тогда
			Запрос.УстановитьПараметр("Партнер", Справочники.Партнеры.ПустаяСсылка());
			Запрос.УстановитьПараметр("ТипПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
			Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
			Запрос.УстановитьПараметр("ТипАдрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			Наименование= ПараметрыПроверки.Наименование;
			НаименованиеПолное = ПараметрыПроверки.НаименованиеПолное;
			
			Почта = ПараметрыПроверки.Почта;
			Телефон = ПараметрыПроверки.Телефон;
			Адрес = ПараметрыПроверки.Адрес;
		Иначе
			Наименование = Партнер.Наименование;
			НаименованиеПолное = Партнер.НаименованиеПолное;
			
			Запрос.УстановитьПараметр("Партнер", Партнер);
			Запрос.УстановитьПараметр("ТипПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
			Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
			Запрос.УстановитьПараметр("ТипАдрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			Почта = АльтерраОбщегоНазначения.ПолучитьКонтактнуюИнформацию(Партнер, Справочники.ВидыКонтактнойИнформации.EmailПартнера);
			Телефон = АльтерраОбщегоНазначения.ПолучитьКонтактнуюИнформацию(Партнер, Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
			Адрес = АльтерраОбщегоНазначения.ПолучитьКонтактнуюИнформацию(Партнер, Справочники.ВидыКонтактнойИнформации.АдресПартнера);		
		КонецЕсли;
		
	мФИО = СтрРазделить(Наименование, " ", Ложь);
	Если мФИО.Количество() > 0 Тогда
		Фамилия = мФИО[0];
	Иначе
		Фамилия = "";
	КонецЕсли;
	Если СтрДлина(Фамилия) < 4 Тогда
		Фамилия = "";
	КонецЕсли;
	
	мФИО = СтрРазделить(НаименованиеПолное, " ", Ложь);
	Если мФИО.Количество() > 0 Тогда
		Фамилия2 = мФИО[0];
	Иначе
		Фамилия2 = "";
	КонецЕсли;
	Если СтрДлина(Фамилия2) < 4 Тогда
		Фамилия2 = "";
	КонецЕсли;

	Запрос.УстановитьПараметр("Фамилия", ?(ПустаяСтрока(Фамилия), "*************", "%"+Фамилия+" %" ));
	Запрос.УстановитьПараметр("Фамилия2", ?(ПустаяСтрока(Фамилия2), "*************", "%"+Фамилия2+" %" ));
		
	Запрос.УстановитьПараметр("Почта", ?(ПустаяСтрока(Почта), "*************", Почта ));
	Запрос.УстановитьПараметр("Телефон", ?(ПустаяСтрока(Телефон), "*************", Телефон ));
	Запрос.УстановитьПараметр("Адрес", ?(ПустаяСтрока(Адрес), "*************", Адрес ));

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	мОтветов = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ответ = Новый Структура("Партнер, Проверка");
		ЗаполнитьЗначенияСвойств(Ответ, ВыборкаДетальныеЗаписи);
		мОтветов.Добавить(Ответ);
	КонецЦикла;
	
	Возврат мОтветов; 
	
КонецФункции

#КонецОбласти
